QX-C2000-DSP/f280049revb_evb_examples/libs/driverlib/adc.h
#ifndef ADC_H
#define ADC_H

//*****************************************************************************
//
// If building with a C++ compiler, make all of the definitions in this header
// have a C binding.
//
//*****************************************************************************
#ifdef __cplusplus
extern "C" {
#endif

//*****************************************************************************
//
//! \addtogroup adc_api ADC
//! @{
//
//*****************************************************************************

#include <stdbool.h>
#include <stdint.h>
#include <inc/hw_adc.h>
#include "inc/hw_memmap.h"
#include "inc/hw_types.h"
#include "cpu.h"
#include "debug.h"

#include "f28004x_device.h"
//*****************************************************************************
//
// Useful defines used within the driver functions. Not intended for use by
// application code.
//
//*****************************************************************************
#define ADC_NUM_INTERRUPTS 4U

#define ADC_SOCxCTL_OFFSET_BASE    ADC_O_SOC0CTL
#define ADC_RESULTx_OFFSET_BASE    ADC_O_RESULT0
#define ADC_INTSELxNy_OFFSET_BASE  ADC_O_INTSEL1N2
#define ADC_PPBxRESULT_OFFSET_BASE ADC_O_PPB1RESULT

#define ADC_PPBxCONFIG_STEP (ADC_O_PPB2CONFIG - ADC_O_PPB1CONFIG)
#define ADC_PPBxTRIPHI_STEP (ADC_O_PPB2TRIPHI - ADC_O_PPB1TRIPHI)
#define ADC_PPBxTRIPLO_STEP (ADC_O_PPB2TRIPLO - ADC_O_PPB1TRIPLO)
#define ADC_PPBxSTAMP_STEP  (ADC_O_PPB2STAMP - ADC_O_PPB1STAMP)
#define ADC_PPBxOFFCAL_STEP (ADC_O_PPB2OFFCAL - ADC_O_PPB1OFFCAL)
#define ADC_PPBxOFFREF_STEP (ADC_O_PPB2OFFREF - ADC_O_PPB1OFFREF)

#define ADC_PPBTRIP_MASK     ((uint32_t)ADC_PPB1TRIPHI_LIMITHI_M | (uint32_t)ADC_PPB1TRIPHI_HSIGN)
#define ADC_INT_REF_TSSLOPE  0.006F
#define ADC_INT_REF_TSOFFSET 1.1F
#define ADC_EXT_REF_TSSLOPE  0.006F
#define ADC_EXT_REF_TSOFFSET 1.1F

#ifndef DOXYGEN_PDF_IGNORE
//*****************************************************************************
//
// Values that can be passed to ADC_enablePPBEvent(), ADC_disablePPBEvent(),
// ADC_enablePPBEventInterrupt(), ADC_disablePPBEventInterrupt(), and
// ADC_clearPPBEventStatus() as the intFlags and evtFlags parameters. They also
// make up the enumerated bit field returned by ADC_getPPBEventStatus().
//
//*****************************************************************************
#define ADC_EVT_TRIPHI 0x0001U //!< Trip High Event
#define ADC_EVT_TRIPLO 0x0002U //!< Trip Low Event
#define ADC_EVT_ZERO   0x0004U //!< Zero Crossing Event
#endif

//*****************************************************************************
//
// Values that can be passed to ADC_forceMultipleSOC() as socMask parameter.
// These values can be OR'd together to trigger multiple SOCs at a time.
//
//*****************************************************************************
#define ADC_FORCE_SOC0  0x0001U //!< SW trigger ADC SOC 0
#define ADC_FORCE_SOC1  0x0002U //!< SW trigger ADC SOC 1
#define ADC_FORCE_SOC2  0x0004U //!< SW trigger ADC SOC 2
#define ADC_FORCE_SOC3  0x0008U //!< SW trigger ADC SOC 3
#define ADC_FORCE_SOC4  0x0010U //!< SW trigger ADC SOC 4
#define ADC_FORCE_SOC5  0x0020U //!< SW trigger ADC SOC 5
#define ADC_FORCE_SOC6  0x0040U //!< SW trigger ADC SOC 6
#define ADC_FORCE_SOC7  0x0080U //!< SW trigger ADC SOC 7
#define ADC_FORCE_SOC8  0x0100U //!< SW trigger ADC SOC 8
#define ADC_FORCE_SOC9  0x0200U //!< SW trigger ADC SOC 9
#define ADC_FORCE_SOC10 0x0400U //!< SW trigger ADC SOC 10
#define ADC_FORCE_SOC11 0x0800U //!< SW trigger ADC SOC 11
#define ADC_FORCE_SOC12 0x1000U //!< SW trigger ADC SOC 12
#define ADC_FORCE_SOC13 0x2000U //!< SW trigger ADC SOC 13
#define ADC_FORCE_SOC14 0x4000U //!< SW trigger ADC SOC 14
#define ADC_FORCE_SOC15 0x8000U //!< SW trigger ADC SOC 15

//*****************************************************************************
//
// Define to mask out the bits in the CHECKSTATUS register that aren't
// associated with safety checker result status.
//
//*****************************************************************************
#define ADC_SAFECHECK_STATUS_MASK \
    (ADC_SAFECHECK_RESULT1_READY | ADC_SAFECHECK_RESULT2_READY | ADC_SAFECHECK_RESULT_OOT)

typedef enum
{
    ADC_SAMPLE_WINDOW_1  = 0U,  //!< Set ADC acquisition window duration to 1
    ADC_SAMPLE_WINDOW_2  = 1U,  //!< Set ADC acquisition window duration to 2
    ADC_SAMPLE_WINDOW_3  = 2U,  //!< Set ADC acquisition window duration to 3
    ADC_SAMPLE_WINDOW_4  = 3U,  //!< Set ADC acquisition window duration to 4
    ADC_SAMPLE_WINDOW_5  = 4U,  //!< Set ADC acquisition window duration to 5
    ADC_SAMPLE_WINDOW_6  = 5U,  //!< Set ADC acquisition window duration to 6
    ADC_SAMPLE_WINDOW_7  = 6U,  //!< Set ADC acquisition window duration to 7
    ADC_SAMPLE_WINDOW_8  = 7U,  //!< Set ADC acquisition window duration to 8
    ADC_SAMPLE_WINDOW_10 = 8U,  //!< Set ADC acquisition window duration to 10
    ADC_SAMPLE_WINDOW_20 = 9U,  //!< Set ADC acquisition window duration to 20
    ADC_SAMPLE_WINDOW_30 = 10U, //!< Set ADC acquisition window duration to 30
    ADC_SAMPLE_WINDOW_40 = 11U, //!< Set ADC acquisition window duration to 40
    ADC_SAMPLE_WINDOW_50 = 12U, //!< Set ADC acquisition window duration to 50
    ADC_SAMPLE_WINDOW_60 = 13U, //!< Set ADC acquisition window duration to 60
    ADC_SAMPLE_WINDOW_70 = 14U, //!< Set ADC acquisition window duration to 70
    ADC_SAMPLE_WINDOW_80 = 15U  //!< Set ADC acquisition window duration to 80
} ADC_SampleWindow;

//*****************************************************************************
//
//! Values that can be passed to ADC_setPrescaler() as the \e clkPrescale
//! parameter.
//
//*****************************************************************************
typedef enum
{
    ADC_CLK_DIV_1_0  = 1U,  //!< ADCCLK = (input clock) / 2.0
    ADC_CLK_DIV_2_0  = 2U,  //!< ADCCLK = (input clock) / 2.0
    ADC_CLK_DIV_3_0  = 3U,  //!< ADCCLK = (input clock) / 3.0
    ADC_CLK_DIV_4_0  = 4U,  //!< ADCCLK = (input clock) / 4.0
    ADC_CLK_DIV_5_0  = 5U,  //!< ADCCLK = (input clock) / 5.0
    ADC_CLK_DIV_6_0  = 6U,  //!< ADCCLK = (input clock) / 6.0
    ADC_CLK_DIV_7_0  = 7U,  //!< ADCCLK = (input clock) / 7.0
    ADC_CLK_DIV_8_0  = 8U,  //!< ADCCLK = (input clock) / 8.0
    ADC_CLK_DIV_9_0  = 9U,  //!< ADCCLK = (input clock) / 9.0
    ADC_CLK_DIV_10_0 = 10U, //!< ADCCLK = (input clock) / 10.0
    ADC_CLK_DIV_11_0 = 11U, //!< ADCCLK = (input clock) / 11.0
    ADC_CLK_DIV_12_0 = 12U, //!< ADCCLK = (input clock) / 12.0
    ADC_CLK_DIV_13_0 = 13U, //!< ADCCLK = (input clock) / 13.0
    ADC_CLK_DIV_14_0 = 14U, //!< ADCCLK = (input clock) / 14.0
    ADC_CLK_DIV_15_0 = 15U, //!< ADCCLK = (input clock) / 15.0
    ADC_CLK_DIV_16_0 = 16U, //!< ADCCLK = (input clock) / 16.0
    ADC_CLK_DIV_17_0 = 17U, //!< ADCCLK = (input clock) / 17.0
    ADC_CLK_DIV_18_0 = 18U, //!< ADCCLK = (input clock) / 18.0
    ADC_CLK_DIV_19_0 = 19U, //!< ADCCLK = (input clock) / 19.0
    ADC_CLK_DIV_20_0 = 20U, //!< ADCCLK = (input clock) / 20.0
    ADC_CLK_DIV_21_0 = 21U, //!< ADCCLK = (input clock) / 21.0
    ADC_CLK_DIV_22_0 = 22U, //!< ADCCLK = (input clock) / 22.0
    ADC_CLK_DIV_23_0 = 23U, //!< ADCCLK = (input clock) / 23.0
    ADC_CLK_DIV_24_0 = 24U, //!< ADCCLK = (input clock) / 24.0
    ADC_CLK_DIV_25_0 = 25U, //!< ADCCLK = (input clock) / 25.0
    ADC_CLK_DIV_26_0 = 26U, //!< ADCCLK = (input clock) / 26.0
    ADC_CLK_DIV_27_0 = 27U, //!< ADCCLK = (input clock) / 27.0
    ADC_CLK_DIV_28_0 = 28U, //!< ADCCLK = (input clock) / 28.0
    ADC_CLK_DIV_29_0 = 29U, //!< ADCCLK = (input clock) / 29.0
    ADC_CLK_DIV_30_0 = 30U, //!< ADCCLK = (input clock) / 30.0
    ADC_CLK_DIV_31_0 = 31U, //!< ADCCLK = (input clock) / 31.0
} ADC_ClkPrescale;

//*****************************************************************************
//
//! Values that can be passed to ADC_setupSOC() as the \e trigger
//! parameter to specify the event that will trigger a conversion to start.
//! It is also used with ADC_setBurstModeConfig() and
//! ADC_triggerRepeaterSelect().
//
//*****************************************************************************
typedef enum
{
    ADC_TRIGGER_SW_ONLY     = 0U,  //!< Software only
    ADC_TRIGGER_CPU1_TINT0  = 1U,  //!< CPU1 Timer 0, TINT0
    ADC_TRIGGER_CPU1_TINT1  = 2U,  //!< CPU1 Timer 1, TINT1
    ADC_TRIGGER_CPU1_TINT2  = 3U,  //!< CPU1 Timer 2, TINT2
    ADC_TRIGGER_GPIO        = 4U,  //!< GPIO, ADCEXTSOC
    ADC_TRIGGER_EPWM1_SOCA  = 5U,  //!< ePWM1, ADCSOCA
    ADC_TRIGGER_EPWM1_SOCB  = 6U,  //!< ePWM1, ADCSOCB
    ADC_TRIGGER_EPWM2_SOCA  = 7U,  //!< ePWM2, ADCSOCA
    ADC_TRIGGER_EPWM2_SOCB  = 8U,  //!< ePWM2, ADCSOCB
    ADC_TRIGGER_EPWM3_SOCA  = 9U,  //!< ePWM3, ADCSOCA
    ADC_TRIGGER_EPWM3_SOCB  = 10U, //!< ePWM3, ADCSOCB
    ADC_TRIGGER_EPWM4_SOCA  = 11U, //!< ePWM4, ADCSOCA
    ADC_TRIGGER_EPWM4_SOCB  = 12U, //!< ePWM4, ADCSOCB
    ADC_TRIGGER_EPWM5_SOCA  = 13U, //!< ePWM5, ADCSOCA
    ADC_TRIGGER_EPWM5_SOCB  = 14U, //!< ePWM5, ADCSOCB
    ADC_TRIGGER_EPWM6_SOCA  = 15U, //!< ePWM6, ADCSOCA
    ADC_TRIGGER_EPWM6_SOCB  = 16U, //!< ePWM6, ADCSOCB
    ADC_TRIGGER_EPWM7_SOCA  = 17U, //!< ePWM7, ADCSOCA
    ADC_TRIGGER_EPWM7_SOCB  = 18U, //!< ePWM7, ADCSOCB
    ADC_TRIGGER_EPWM8_SOCA  = 19U, //!< ePWM8, ADCSOCA
    ADC_TRIGGER_EPWM8_SOCB  = 20U, //!< ePWM8, ADCSOCB
    ADC_TRIGGER_CPU2_TINT0  = 21U, //!< CPU2 Timer 0, TINT0
    ADC_TRIGGER_CPU2_TINT1  = 22U, //!< CPU2 Timer 1, TINT1
    ADC_TRIGGER_CPU2_TINT2  = 23U, //!< CPU2 Timer 2, TINT2
    ADC_TRIGGER_EPWM9_SOCA  = 24U, //!< ePWM9, ADCSOCA
    ADC_TRIGGER_EPWM9_SOCB  = 25U, //!< ePWM9, ADCSOCB
    ADC_TRIGGER_EPWM10_SOCA = 26U, //!< ePWM10, ADCSOCA
    ADC_TRIGGER_EPWM10_SOCB = 27U, //!< ePWM10, ADCSOCB
    ADC_TRIGGER_EPWM11_SOCA = 28U, //!< ePWM11, ADCSOCA
    ADC_TRIGGER_EPWM11_SOCB = 29U, //!< ePWM11, ADCSOCB
    ADC_TRIGGER_EPWM12_SOCA = 30U, //!< ePWM12, ADCSOCA
    ADC_TRIGGER_EPWM12_SOCB = 31U, //!< ePWM12, ADCSOCB
    ADC_TRIGGER_INT1        = 32U, //!< ADC INT0
    ADC_TRIGGER_INT2        = 33U, //!< ADC INT1
} ADC_Trigger;

//*****************************************************************************
//
//! Values that can be passed to ADC_setupSOC() as the \e channel
//! parameter. This is the input pin on which the signal to be converted is
//! located.
//
//*****************************************************************************
typedef enum
{
    ADC_CH_ADCIN0          = 0U,  //!< single-ended, ADCIN0
    ADC_CH_ADCIN1          = 1U,  //!< single-ended, ADCIN1
    ADC_CH_ADCIN2          = 2U,  //!< single-ended, ADCIN2
    ADC_CH_ADCIN3          = 3U,  //!< single-ended, ADCIN3
    ADC_CH_ADCIN4          = 4U,  //!< single-ended, ADCIN4
    ADC_CH_ADCIN5          = 5U,  //!< single-ended, ADCIN5
    ADC_CH_ADCIN6          = 6U,  //!< single-ended, ADCIN6
    ADC_CH_ADCIN7          = 7U,  //!< single-ended, ADCIN7
    ADC_CH_ADCIN8          = 8U,  //!< single-ended, ADCIN8
    ADC_CH_ADCIN9          = 9U,  //!< single-ended, ADCIN9
    ADC_CH_ADCIN10         = 10U, //!< single-ended, ADCIN10
    ADC_CH_ADCIN11         = 11U, //!< single-ended, ADCIN11
    ADC_CH_ADCIN12         = 12U, //!< single-ended, ADCIN12
    ADC_CH_ADCIN13         = 13U, //!< single-ended, ADCIN13
    ADC_CH_ADCIN14         = 14U, //!< single-ended, ADCIN14
    ADC_CH_ADCIN15         = 15U, //!< single-ended, ADCIN15
    ADC_CH_ADCIN0_ADCIN1   = 0U,  //!< differential, ADCIN0 and ADCIN1
    ADC_CH_ADCIN2_ADCIN3   = 2U,  //!< differential, ADCIN2 and ADCIN3
    ADC_CH_ADCIN4_ADCIN5   = 4U,  //!< differential, ADCIN4 and ADCIN5
    ADC_CH_ADCIN6_ADCIN7   = 6U,  //!< differential, ADCIN6 and ADCIN7
    ADC_CH_ADCIN8_ADCIN9   = 8U,  //!< differential, ADCIN8 and ADCIN9
    ADC_CH_ADCIN10_ADCIN11 = 10U, //!< differential, ADCIN10 and ADCIN11
    ADC_CH_ADCIN12_ADCIN13 = 12U, //!< differential, ADCIN12 and ADCIN13
    ADC_CH_ADCIN14_ADCIN15 = 14U, //!< differential, ADCIN14 and ADCIN15
} ADC_Channel;

//*****************************************************************************
//
//! Values that can be passed to ADC_setInterruptPulseMode() as the
//! \e pulseMode parameter.
//
//*****************************************************************************
typedef enum
{
    //! Occurs at the end of the acquisition window
    ADC_PULSE_END_OF_ACQ_WIN = 0x00U,
    //! Occurs at the end of the conversion
    ADC_PULSE_END_OF_CONV = 0x04U
} ADC_PulseMode;

//*****************************************************************************
//
//! Values that can be passed to ADC_enableInterrupt(), ADC_disableInterrupt(),
//! and ADC_getInterruptStatus() as the \e adcIntNum parameter.
//
//*****************************************************************************
typedef enum
{
    ADC_INT_NUMBER1 = 0U, //!< ADCINT1 Interrupt
    ADC_INT_NUMBER2 = 1U, //!< ADCINT2 Interrupt
    ADC_INT_NUMBER3 = 2U, //!< ADCINT3 Interrupt
    ADC_INT_NUMBER4 = 3U  //!< ADCINT4 Interrupt
} ADC_IntNumber;

//*****************************************************************************
//
//! Values that can be passed in as the \e ppbNumber parameter for several
//! functions.
//
//*****************************************************************************
typedef enum
{
    ADC_PPB_NUMBER1 = 0U, //!< Post-processing block 1
    ADC_PPB_NUMBER2 = 1U, //!< Post-processing block 2
    ADC_PPB_NUMBER3 = 2U, //!< Post-processing block 3
    ADC_PPB_NUMBER4 = 3U  //!< Post-processing block 4
} ADC_PPBNumber;

//*****************************************************************************
//
//! Values that can be passed in as the \e socNumber parameter for several
//! functions. This value identifies the start-of-conversion (SOC) that a
//! function is configuring or accessing. Note that in some cases (for example,
//! ADC_setInterruptSource()) \e socNumber is used to refer to the
//! corresponding end-of-conversion (EOC).
//
//*****************************************************************************
typedef enum
{
    ADC_SOC_NUMBER0  = 0U,  //!< SOC/EOC number 0
    ADC_SOC_NUMBER1  = 1U,  //!< SOC/EOC number 1
    ADC_SOC_NUMBER2  = 2U,  //!< SOC/EOC number 2
    ADC_SOC_NUMBER3  = 3U,  //!< SOC/EOC number 3
    ADC_SOC_NUMBER4  = 4U,  //!< SOC/EOC number 4
    ADC_SOC_NUMBER5  = 5U,  //!< SOC/EOC number 5
    ADC_SOC_NUMBER6  = 6U,  //!< SOC/EOC number 6
    ADC_SOC_NUMBER7  = 7U,  //!< SOC/EOC number 7
    ADC_SOC_NUMBER8  = 8U,  //!< SOC/EOC number 8
    ADC_SOC_NUMBER9  = 9U,  //!< SOC/EOC number 9
    ADC_SOC_NUMBER10 = 10U, //!< SOC/EOC number 10
    ADC_SOC_NUMBER11 = 11U, //!< SOC/EOC number 11
    ADC_SOC_NUMBER12 = 12U, //!< SOC/EOC number 12
    ADC_SOC_NUMBER13 = 13U, //!< SOC/EOC number 13
    ADC_SOC_NUMBER14 = 14U, //!< SOC/EOC number 14
    ADC_SOC_NUMBER15 = 15U  //!< SOC/EOC number 15
} ADC_SOCNumber;

//*****************************************************************************
//
//! Values that can be passed in as the \e trigger parameter for the
//! ADC_setInterruptSOCTrigger() function.
//
//*****************************************************************************
typedef enum
{
    ADC_INT_SOC_TRIGGER_NONE    = 0U, //!< No ADCINT will trigger the SOC
    ADC_INT_SOC_TRIGGER_ADCINT1 = 1U, //!< ADCINT1 will trigger the SOC
    ADC_INT_SOC_TRIGGER_ADCINT2 = 2U  //!< ADCINT2 will trigger the SOC
} ADC_IntSOCTrigger;

//*****************************************************************************
//
//! Values that can be passed to ADC_setSOCPriority() as the \e priMode
//! parameter.
//
//*****************************************************************************
typedef enum
{
    ADC_PRI_ALL_ROUND_ROBIN  = 0U,  //!< Round robin mode is used for all
    ADC_PRI_SOC0_HIPRI       = 1U,  //!< SOC 0 hi pri, others in round robin
    ADC_PRI_THRU_SOC1_HIPRI  = 2U,  //!< SOC 0-1 hi pri, others in round robin
    ADC_PRI_THRU_SOC2_HIPRI  = 3U,  //!< SOC 0-2 hi pri, others in round robin
    ADC_PRI_THRU_SOC3_HIPRI  = 4U,  //!< SOC 0-3 hi pri, others in round robin
    ADC_PRI_THRU_SOC4_HIPRI  = 5U,  //!< SOC 0-4 hi pri, others in round robin
    ADC_PRI_THRU_SOC5_HIPRI  = 6U,  //!< SOC 0-5 hi pri, others in round robin
    ADC_PRI_THRU_SOC6_HIPRI  = 7U,  //!< SOC 0-6 hi pri, others in round robin
    ADC_PRI_THRU_SOC7_HIPRI  = 8U,  //!< SOC 0-7 hi pri, others in round robin
    ADC_PRI_THRU_SOC8_HIPRI  = 9U,  //!< SOC 0-8 hi pri, others in round robin
    ADC_PRI_THRU_SOC9_HIPRI  = 10U, //!< SOC 0-9 hi pri, others in round robin
    ADC_PRI_THRU_SOC10_HIPRI = 11U, //!< SOC 0-10 hi pri, others in round robin
    ADC_PRI_THRU_SOC11_HIPRI = 12U, //!< SOC 0-11 hi pri, others in round robin
    ADC_PRI_THRU_SOC12_HIPRI = 13U, //!< SOC 0-12 hi pri, others in round robin
    ADC_PRI_THRU_SOC13_HIPRI = 14U, //!< SOC 0-13 hi pri, others in round robin
    ADC_PRI_THRU_SOC14_HIPRI = 15U, //!< SOC 0-14 hi pri, SOC15 in round robin
    ADC_PRI_ALL_HIPRI        = 16U  //!< All priorities based on SOC number
} ADC_PriorityMode;

//*****************************************************************************
//
//! Values that can be passed to ADC_getTemperatureC(), ADC_getTemperatureK(),
//! ADC_setVREF() and ADC_setOffsetTrimAll() as the \e refMode parameter.
//
//*****************************************************************************
typedef enum
{
    ADC_REFERENCE_INTERNAL = 0U,
    ADC_REFERENCE_EXTERNAL = 1U
} ADC_ReferenceMode;

//*****************************************************************************
//
//! Values that can be passed to ADC_setVREF() and ADC_setOffsetTrimAll() as the
//! \e refVoltage parameter.
//!
//
//*****************************************************************************
typedef enum
{
    ADC_REFERENCE_1_65V = 0U,
    ADC_REFERENCE_2_0V  = 1U,
    ADC_REFERENCE_2_5V  = 2U,
    ADC_REFERENCE_3_3V  = 3U
} ADC_ReferenceVoltage;

//*****************************************************************************
//
//! Values that can be passed to ADC_configOSDetectMode() as the \e modeVal
//! parameter.
//
//*****************************************************************************
typedef enum
{
    ADC_OSDETECT_MODE_DISABLED = 0x0U,            //!< Open/Shorts detection cir-
                                                  //!< cuit(O/S DC) is disabled
    ADC_OSDETECT_MODE_VSSA = 0x1U,                //!< O/S DC is enabled at zero
                                                  //!< scale
    ADC_OSDETECT_MODE_VDDA = 0x2U,                //!< O/S DC is enabled at full
                                                  //!< scale
    ADC_OSDETECT_MODE_5BY12_VDDA = 0x3U,          //!< O/S DC is enabled at 5/12
                                                  //!< scale
    ADC_OSDETECT_MODE_7BY12_VDDA = 0x4U,          //!< O/S DC is enabled at 7/12
                                                  //!< scale
    ADC_OSDETECT_MODE_5K_PULLDOWN_TO_VSSA = 0x5U, //!< O/S DC is enabled at 5K
                                                  //!< pulldown to VSSA
    ADC_OSDETECT_MODE_5K_PULLUP_TO_VDDA = 0x6U,   //!< O/S DC is enabled at 5K
                                                  //!< pullup to VDDA
    ADC_OSDETECT_MODE_7K_PULLDOWN_TO_VSSA = 0x7U  //!< O/S DC is enabled at 7K
                                                  //!< pulldown to VSSA
} ADC_OSDetectMode;

//*****************************************************************************
//
// Prototypes for the APIs.
//
//*****************************************************************************
//*****************************************************************************
//
//! \internal
//! Checks an ADC base address.
//!
//! \param base specifies the ADC module base address.
//!
//! This function determines if a ADC module base address is valid.
//!
//! \return Returns \b true if the base address is valid and \b false
//! otherwise.
//
//*****************************************************************************
#ifdef DEBUG
static inline bool ADC_isBaseValid(uint32_t base)
{
    return ((base == ADCA_BASE) || (base == ADCB_BASE) || (base == ADCC_BASE) || (base == ADCG_BASE)
            || (base == ADCH_BASE));
}
#endif

//*****************************************************************************
//
//! Configures the analog-to-digital converter module prescaler.
//!
//! \param base is the base address of the ADC module.
//! \param clkPrescale is the ADC clock prescaler.
//!
//! This function configures the ADC module's ADCCLK.
//!
//! The \e clkPrescale parameter specifies the value by which the input clock
//! is divided to make the ADCCLK.  The clkPrescale value can be specified with
//! any of the following enum values:
//! \b ADC_CLK_DIV_1_0, \b ADC_CLK_DIV_2_0, \b ADC_CLK_DIV_2_5, ...,
//! \b ADC_CLK_DIV_7_5, \b ADC_CLK_DIV_8_0, or \b ADC_CLK_DIV_8_5.
//!
//! \return None.
//
//*****************************************************************************
static inline void ADC_setPrescaler(uint32_t base, ADC_ClkPrescale clkPrescale)
{
    //
    // Check the arguments.
    //
    ASSERT(ADC_isBaseValid(base));

    //
    // Set the configuration of the ADC module prescaler.
    //
    EALLOW;
    HWREG(base + ADC_O_CTL2)
        = (HWREG(base + ADC_O_CTL2) & ~ADC_CTL2_PRESCALE_M) | (uint32_t)clkPrescale;
    EDIS;
}

//*****************************************************************************
//
//! Configures a start-of-conversion (SOC) in the ADC.
//!
//! \param base is the base address of the ADC module.
//! \param socNumber is the number of the start-of-conversion.
//! \param trigger the source that will cause the SOC.
//! \param channel is the number associated with the input signal.
//! \param sampleWindow is the acquisition window duration.
//!
//! This function configures the a start-of-conversion (SOC) in the ADC module.
//!
//! The \e socNumber number is a value \b ADC_SOC_NUMBERX where X is a number
//! from 0 to 15 specifying which SOC is to be configured on the ADC module
//! specified by \e base.
//!
//! The \e trigger specifies the event that causes the SOC such as software, a
//! timer interrupt, an ePWM event, or an ADC interrupt. It should be a value
//! in the format of \b ADC_TRIGGER_XXXX where XXXX is the event such as
//! \b ADC_TRIGGER_SW_ONLY, \b ADC_TRIGGER_CPU1_TINT0, \b ADC_TRIGGER_GPIO,
//! \b ADC_TRIGGER_EPWM1_SOCA, and so on.
//!
//! The \e channel parameter specifies the channel to be converted. In
//! single-ended mode this is a single pin given by \b ADC_CH_ADCINx where x is
//! the number identifying the pin between 0 and 31 inclusive. In differential
//! mode, two pins are used as inputs and are passed in the \e channel
//! parameter as \b ADC_CH_ADCIN0_ADCIN1, \b ADC_CH_ADCIN2_ADCIN3, ..., or
//! \b ADC_CH_ADCIN14_ADCIN15.
//!
//! The \e sampleWindow parameter is the acquisition window duration in SYSCLK
//! cycles. It should be a value between 1 and 512 cycles inclusive. The
//! selected duration must be at least as long as one ADCCLK cycle. Also, the
//! datasheet will specify a minimum window duration requirement in
//! nanoseconds.
//!
//! \return None.
//
//*****************************************************************************
static inline void ADC_setupSOC(uint32_t base, ADC_SOCNumber socNumber, ADC_Trigger trigger,
    ADC_Channel channel, uint32_t sampleWindow)
{
    uint32_t ctlRegAddr, mask;

    //
    // Check the arguments.
    //
    ASSERT(ADC_isBaseValid(base));
    ASSERT((sampleWindow >= 1U) && (sampleWindow <= 512U));

